---
kind: method
id: M:Autodesk.Revit.UI.RibbonButtonOptions.Dispose
source: html/bcef6259-881f-0dd4-5831-8643d8fc4ca9.htm
---
# Autodesk.Revit.UI.RibbonButtonOptions.Dispose Method

Releases all resources used by the RibbonButtonOptions

## Syntax (C#)
```csharp
public void Dispose()
```